Autodesk.Revit.DB.ContourSettingItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ContourSettingItem.SubCategoryId
The contour line style subcategory id.
Since:
2024

Autodesk.Revit.DB.ContourSettingItem.Step
The increment elevation of the contour range.
Since:
2024

Autodesk.Revit.DB.ContourSettingItem.Stop
The contour range stop elevation.
Since:
2024

Autodesk.Revit.DB.ContourSettingItem.Start
The contour range start elevation.
Since:
2024

Autodesk.Revit.DB.ContourSettingItem
Contour setting item that stores the information of a single contour or a set of contours.
Since:
2024